a = int(input("Вітаємо у грі, 'Вгадай число'.\nЩоб почати грати, вам потрібний другий гравець.\nНапишіть 1, щоби почати гру, напишіть 2, щоби вийти: "))

if a == 1:
    b = input("Окей, у вас є 5 спроб, нажміть ENTER, щоб продовжити: ")
    p1 = int(input("Player 1, напишіть число: "))
    for num in range(5):
        p2 = int(input("Player 2, вгадуйте число: "))
        if p1 == p2:
            win = input("Вітаємо! Ви виграли!")
        else:
            print(f"Ви не вгадали, але у вас ще є спроб!")
if a == 2:
    exit