# змінна - це змінна якось числа, або значення коду. Приклад: a = 4, зміною можна зробити різні речі: a = 4-3, a = input("Якесь значення: ")
# 2. - str, int, bool, словник, лист
# 3. - функція - це команда приймає обєкти. def(main):
# 4. string (lower, upper)
# 6. - це команда або шаблон, для створення різних команд. Та функцій в середині неї, класи більш точніше використовують, для одинакових обєкстів т.д.
# 5. protect, privat, public
# 7. while True:
# print("hello wrold!")

bankmain = int(input("Вітаємо у Банківському сейфу! Виберіть: \n 1 - щоби створити нового користувача: \n 2 - вписати данні."))

class BankLogin():
 def()

if bankmain == 1:
  pass

#Зробити програмку “Банківський сейф”:

#Користувач вводить якісь данні і вибирає захищеність після чого його данні шифруються і ховаються. Отримати свої данні може тільки він. Зробіть можливість створення декількох користувачів.

#На вхід подаються числа, які відразу приховуються і з якими всередині інкапсульованого методу проводиться випадкова математична операція. Якщо ж вивести об’єкт, на екрані з’явиться результат обчислень.